Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR21_DFP/2.0.52/atdf/ATSAMR21E19A.atdf
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x42002800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA12"/>
              <signal group="WO" index="0" function="E" pad="PA16"/>
              <signal group="WO" index="0" function="E" pad="PA00"/>
              <signal group="WO" index="1" function="E" pad="PA17"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="21" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features"/>
              <param name="GCLK_ID" value="27" caption="Index of Generic Clock"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PG" value="0" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="TYPE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="INSTANCE_ID" value="74"/>
            </parameters>
          </instance>
        </module>
        <module name="USB" id="U2222" version="1.0.1">
          <instance name="USB">
            <register-group name="USB" name-in-module="USB" address-space="base" offset="0x41005000"/>
            <signals>
              <signal group="DM" function="G" pad="PA24"/>
              <signal group="DP" function="G" pad="PA25"/>
              <signal group="SOF_1KHZ" function="G" pad="PA23"/>
            </signals>
            <parameters>
              <param name="EPT_NBR" value="8" caption="Number of USB end points (obsolete)"/>
              <param name="EPT_NUM" value="8" caption="Number of USB end points"/>
              <param name="GCLK_ID" value="6" caption="Index of Generic Clock"/>
              <param name="PIPE_NUM" value="8" caption="Number of USB pipes"/>
              <param name="INSTANCE_ID" value="37"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2203" version="2.0.0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40001000"/>
            <parameters>
              <param name="GCLK_ID" value="3" caption="Index of Generic Clock"/>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="NVIC" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
            <parameters>
              <param name="NUM_IRQ" value="28" caption="Number of interrupt requests"/>
              <param name="__NVIC_PRIO_BITS" value="2" caption="Number of NVIC interrupt priority bits"/>
            </parameters>
          </instance>
        </module>
        <module name="SysTick" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
          </instance>
        </module>
        <module name="SystemControl" version="1.0.0">
          <instance name="SystemControl">
            <register-group name="SystemControl" name-in-module="SystemControl" address-space="base" offset="0xE000E000"/>
            <parameters>
              <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present"/>
            </parameters>
          </instance>
        </module>
      </peripherals>
      <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset" header:alternate-caption="Reset Vector"/>
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted" header:alternate-caption="Non-maskable Interrupt"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault" header:alternate-caption="Hard Fault"/>
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction" header:alternate-caption="SuperVisor Call"/>
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service" header:alternate-caption="Pendable SerVice"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
        <interrupt name="PM" index="0" module-instance="PM" caption="Power Manager"/>
        <interrupt name="SYSCTRL" index="1" module-instance="SYSCTRL" caption="System Controller"/>
        <interrupt name="WDT" index="2" module-instance="WDT" caption="Watchdog Timer"/>
        <interrupt name="RTC" index="3" module-instance="RTC" caption="Real Time Counter"/>
        <interrupt name="EIC" index="4" module-instance="EIC" caption="External Interrupt Controller"/>
        <interrupt name="NVMCTRL" index="5" module-instance="NVMCTRL" caption="Non-Volatile Memory Controller"/>
        <interrupt name="DMAC" index="6" module-instance="DMAC" caption="Direct Memory Controller"/>
        <interrupt name="USB" index="7" module-instance="USB" caption="Universal Serial Bus"/>
        <interrupt name="EVSYS" index="8" module-instance="EVSYS" caption="Event Systems"/>
        <interrupt name="SERCOM0" index="9" module-instance="SERCOM0" caption="Serial Communication Interface 0"/>
        <interrupt name="SERCOM1" index="10" module-instance="SERCOM1" caption="Serial Communication Interface 1"/>
        <interrupt name="SERCOM2" index="11" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM3" index="12" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM4" index="13" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM5" index="14" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="TCC0" index="15" module-instance="TCC0" caption="Timer/Counter for Control Applications 0"/>
        <interrupt name="TCC1" index="16" module-instance="TCC1" caption="Timer/Counter for Control Applications 1"/>
        <interrupt name="TCC2" index="17" module-instance="TCC2" caption="Timer/Counter for Control Applications 2"/>
        <interrupt name="TC3" index="18" module-instance="TC3" caption="Timer/Counter 3"/>
        <interrupt name="TC4" index="19" module-instance="TC4" caption="Timer/Counter 4"/>
        <interrupt name="TC5" index="20" module-instance="TC5" caption="Timer/Counter 5"/>
        <interrupt name="ADC" index="23" module-instance="ADC" caption="Analog-to-Digital Converter"/>
        <interrupt name="AC" index="24" module-instance="AC" caption="Analog Comparators"/>
        <interrupt name="PTC" index="26" module-instance="PTC" caption="Peripheral Touch Controller"/>
      </interrupts>
      <events>
        <generators>
          <generator name="RTC_CMP_0" index="1" module-instance="RTC"/>
          <generator name="RTC_CMP_1" index="2" module-instance="RTC"/>
          <generator name="RTC_OVF" index="3" module-instance="RTC"/>
          <generator name="RTC_PER_0" index="4" module-instance="RTC"/>
          <generator name="RTC_PER_1" index="5" module-instance="RTC"/>
          <generator name="RTC_PER_2" index="6" module-instance="RTC"/>
          <generator name="RTC_PER_3" index="7" module-instance="RTC"/>
          <generator name="RTC_PER_4" index="8" module-instance="RTC"/>
          <generator name="RTC_PER_5" index="9" module-instance="RTC"/>
          <generator name="RTC_PER_6" index="10" module-instance="RTC"/>
          <generator name="RTC_PER_7" index="11" module-instance="RTC"/>
          <generator name="EIC_EXTINT_0" index="12" module-instance="EIC"/>
          <generator name="EIC_EXTINT_1" index="13" module-instance="EIC"/>
          <generator name="EIC_EXTINT_2" index="14" module-instance="EIC"/>
          <generator name="EIC_EXTINT_3" index="15" module-instance="EIC"/>
          <generator name="EIC_EXTINT_4" index="16" module-instance="EIC"/>
          <generator name="EIC_EXTINT_5" index="17" module-instance="EIC"/>
          <generator name="EIC_EXTINT_6" index="18" module-instance="EIC"/>
          <generator name="EIC_EXTINT_7" index="19" module-instance="EIC"/>
          <generator name="EIC_EXTINT_8" index="20" module-instance="EIC"/>
          <generator name="EIC_EXTINT_9" index="21" module-instance="EIC"/>
          <generator name="EIC_EXTINT_10" index="22" module-instance="EIC"/>
          <generator name="EIC_EXTINT_11" index="23" module-instance="EIC"/>
          <generator name="EIC_EXTINT_12" index="24" module-instance="EIC"/>
          <generator name="EIC_EXTINT_13" index="25" module-instance="EIC"/>
          <generator name="EIC_EXTINT_14" index="26" module-instance="EIC"/>
          <generator name="EIC_EXTINT_15" index="27" module-instance="EIC"/>
          <generator name="DMAC_CH_0" index="30" module-instance="DMAC"/>
          <generator name="DMAC_CH_1" index="31" module-instance="DMAC"/>
          <generator name="DMAC_CH_2" index="32" module-instance="DMAC"/>
          <generator name="DMAC_CH_3" index="33" module-instance="DMAC"/>
          <generator name="TCC0_OVF" index="34" module-instance="TCC0"/>
          <generator name="TCC0_TRG" index="35" module-instance="TCC0"/>
          <generator name="TCC0_CNT" index="36" module-instance="TCC0"/>
          <generator name="TCC0_MCX_0" index="37" module-instance="TCC0"/>
          <generator name="TCC0_MCX_1" index="38" module-instance="TCC0"/>
          <generator name="TCC0_MCX_2" index="39" module-instance="TCC0"/>
          <generator name="TCC0_MCX_3" index="40" module-instance="TCC0"/>
          <generator name="TCC1_OVF" index="41" module-instance="TCC1"/>
          <generator name="TCC1_TRG" index="42" module-instance="TCC1"/>
          <generator name="TCC1_CNT" index="43" module-instance="TCC1"/>
          <generator name="TCC1_MCX_0" index="44" module-instance="TCC1"/>
          <generator name="TCC1_MCX_1" index="45" module-instance="TCC1"/>
          <generator name="TCC2_OVF" index="46" module-instance="TCC2"/>
          <generator name="TCC2_TRG" index="47" module-instance="TCC2"/>
          <generator name="TCC2_CNT" index="48" module-instance="TCC2"/>
          <generator name="TCC2_MCX_0" index="49" module-instance="TCC2"/>
          <generator name="TCC2_MCX_1" index="50" module-instance="TCC2"/>
          <generator name="TC3_OVF" index="51" module-instance="TC3"/>
          <generator name="TC3_MCX_0" index="52" module-instance="TC3"/>
          <generator name="TC3_MCX_1" index="53" module-instance="TC3"/>
          <generator name="TC4_OVF" index="54" module-instance="TC4"/>
          <generator name="TC4_MCX_0" index="55" module-instance="TC4"/>
          <generator name="TC4_MCX_1" index="56" module-instance="TC4"/>
          <generator name="TC5_OVF" index="57" module-instance="TC5"/>
          <generator name="TC5_MCX_0" index="58" module-instance="TC5"/>
          <generator name="TC5_MCX_1" index="59" module-instance="TC5"/>
          <generator name="ADC_RESRDY" index="66" module-instance="ADC"/>
          <generator name="ADC_WINMON" index="67" module-instance="ADC"/>
          <generator name="AC_COMP_0" index="68" module-instance="AC"/>
          <generator name="AC_COMP_1" index="69" module-instance="AC"/>
          <generator name="AC_WIN_0" index="70" module-instance="AC"/>
        </generators>
        <users>
          <user name="DMAC_CH_0" index="0" module-instance="DMAC"/>
          <user name="DMAC_CH_1" index="1" module-instance="DMAC"/>
          <user name="DMAC_CH_2" index="2" module-instance="DMAC"/>
          <user name="DMAC_CH_3" index="3" module-instance="DMAC"/>
          <user name="TCC0_EV_0" index="4" module-instance="TCC0"/>
          <user name="TCC0_EV_1" index="5" module-instance="TCC0"/>
          <user name="TCC0_MC_0" index="6" module-instance="TCC0"/>
          <user name="TCC0_MC_1" index="7" module-instance="TCC0"/>
          <user name="TCC0_MC_2" index="8" module-instance="TCC0"/>
          <user name="TCC0_MC_3" index="9" module-instance="TCC0"/>
          <user name="TCC1_EV_0" index="10" module-instance="TCC1"/>
          <user name="TCC1_EV_1" index="11" module-instance="TCC1"/>
          <user name="TCC1_MC_0" index="12" module-instance="TCC1"/>
          <user name="TCC1_MC_1" index="13" module-instance="TCC1"/>
          <user name="TCC2_EV_0" index="14" module-instance="TCC2"/>
          <user name="TCC2_EV_1" index="15" module-instance="TCC2"/>
          <user name="TCC2_MC_0" index="16" module-instance="TCC2"/>
          <user name="TCC2_MC_1" index="17" module-instance="TCC2"/>
          <user name="TC3_EVU" index="18" module-instance="TC3"/>
          <user name="TC4_EVU" index="19" module-instance="TC4"/>
          <user name="TC5_EVU" index="20" module-instance="TC5"/>
          <user name="ADC_START" index="23" module-instance="ADC"/>
          <user name="ADC_SYNC" index="24" module-instance="ADC"/>
          <user name="AC_SOC_0" index="25" module-instance="AC"/>
          <user name="AC_SOC_1" index="26" module-instance="AC"/>
        </users>
      </events>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x10010318"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2205" version="1.1.1" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x4"/>
          <bitfield name="LPMUX" caption="Low-Power Mux" mask="0x80"/>
        </register>
