Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR21_DFP/2.0.52/atdf/ATSAMR21E19A.atdf
        <register name="GENCTRL" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Generic Clock Generator Control">
          <bitfield name="ID" caption="Generic Clock Generator Selection" mask="0xF"/>
          <bitfield name="SRC" caption="Source Select" mask="0x1F00" values="GCLK_GENCTRL__SRC"/>
          <bitfield name="GENEN" caption="Generic Clock Generator Enable" mask="0x10000"/>
          <bitfield name="IDC" caption="Improve Duty Cycle" mask="0x20000"/>
          <bitfield name="OOV" caption="Output Off Value" mask="0x40000"/>
          <bitfield name="OE" caption="Output Enable" mask="0x80000"/>
          <bitfield name="DIVSEL" caption="Divide Selection" mask="0x100000" values="GCLK_GENCTRL__DIVSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x200000"/>
        </register>
        <register name="GENDIV" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Generic Clock Generator Division">
          <bitfield name="ID" caption="Generic Clock Generator Selection" mask="0xF"/>
          <bitfield name="DIV" caption="Division Factor" mask="0xFFFF00"/>
        </register>
      </register-group>
      <value-group name="GCLK_CLKCTRL__GEN">
        <value name="GCLK0" caption="Generic clock generator 0" value="0x0"/>
        <value name="GCLK1" caption="Generic clock generator 1" value="0x1"/>
        <value name="GCLK2" caption="Generic clock generator 2" value="0x2"/>
        <value name="GCLK3" caption="Generic clock generator 3" value="0x3"/>
        <value name="GCLK4" caption="Generic clock generator 4" value="0x4"/>
        <value name="GCLK5" caption="Generic clock generator 5" value="0x5"/>
        <value name="GCLK6" caption="Generic clock generator 6" value="0x6"/>
        <value name="GCLK7" caption="Generic clock generator 7" value="0x7"/>
        <value name="GCLK8" caption="Generic clock generator 8" value="0x8"/>
      </value-group>
      <value-group name="GCLK_CLKCTRL__ID">
        <value name="DFLL48" caption="DFLL48" value="0x0"/>
        <value name="FDPLL" caption="FDPLL" value="0x1"/>
        <value name="FDPLL32K" caption="FDPLL32K" value="0x2"/>
        <value name="WDT" caption="WDT" value="0x3"/>
        <value name="RTC" caption="RTC" value="0x4"/>
        <value name="EIC" caption="EIC" value="0x5"/>
        <value name="USB" caption="USB" value="0x6"/>
        <value name="EVSYS_0" caption="EVSYS_0" value="0x7"/>
        <value name="EVSYS_1" caption="EVSYS_1" value="0x8"/>
        <value name="EVSYS_2" caption="EVSYS_2" value="0x9"/>
        <value name="EVSYS_3" caption="EVSYS_3" value="0xA"/>
        <value name="EVSYS_4" caption="EVSYS_4" value="0xB"/>
        <value name="EVSYS_5" caption="EVSYS_5" value="0xC"/>
        <value name="EVSYS_6" caption="EVSYS_6" value="0xD"/>
        <value name="EVSYS_7" caption="EVSYS_7" value="0xE"/>
        <value name="EVSYS_8" caption="EVSYS_8" value="0xF"/>
        <value name="EVSYS_9" caption="EVSYS_9" value="0x10"/>
        <value name="EVSYS_10" caption="EVSYS_10" value="0x11"/>
        <value name="EVSYS_11" caption="EVSYS_11" value="0x12"/>
        <value name="SERCOMX_SLOW" caption="SERCOMX_SLOW" value="0x13"/>
        <value name="SERCOM0_CORE" caption="SERCOM0_CORE" value="0x14"/>
        <value name="SERCOM1_CORE" caption="SERCOM1_CORE" value="0x15"/>
        <value name="SERCOM2_CORE" caption="SERCOM2_CORE" value="0x16"/>
        <value name="SERCOM3_CORE" caption="SERCOM3_CORE" value="0x17"/>
        <value name="SERCOM4_CORE" caption="SERCOM4_CORE" value="0x18"/>
        <value name="SERCOM5_CORE" caption="SERCOM5_CORE" value="0x19"/>
        <value name="TCC0_TCC1" caption="TCC0_TCC1" value="0x1A"/>
        <value name="TCC2_TC3" caption="TCC2_TC3" value="0x1B"/>
        <value name="TC4_TC5" caption="TC4_TC5" value="0x1C"/>
        <value name="ADC" caption="ADC" value="0x1E"/>
        <value name="AC_DIG" caption="AC_DIG" value="0x1F"/>
        <value name="AC_ANA" caption="AC_ANA" value="0x20"/>
        <value name="I2S_0" caption="I2S_0" value="0x23"/>
        <value name="I2S_1" caption="I2S_1" value="0x24"/>
      </value-group>
      <value-group name="GCLK_GENCTRL__SRC">
        <value name="XOSC" caption="XOSC oscillator output" value="0"/>
        <value name="GCLKIN" caption="Generator input pad" value="1"/>
        <value name="GCLKGEN1" caption="Generic clock generator 1 output" value="2"/>
        <value name="OSCULP32K" caption="OSCULP32K oscillator output" value="3"/>
        <value name="OSC32K" caption="OSC32K oscillator output" value="4"/>
        <value name="XOSC32K" caption="XOSC32K oscillator output" value="5"/>
        <value name="OSC8M" caption="OSC8M oscillator output" value="6"/>
        <value name="DFLL48M" caption="DFLL48M output" value="7"/>
        <value name="DPLL96M" caption="DPLL96M output" value="8"/>
      </value-group>
      <value-group name="GCLK_GENCTRL__DIVSEL">
        <value name="DIV1" caption="Divide input directly by divider factor" value="0x0"/>
        <value name="DIV2" caption="Divide input by 2^(divider factor+ 1)" value="0x1"/>
      </value-group>
    </module>
    <module name="HMATRIXB" id="I7638" version="2.1.2" caption="HSB Matrix">
      <register-group name="PRS" size="0x8">
        <register name="PRAS" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority A for Slave">
        </register>
        <register name="PRBS" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority B for Slave">
        </register>
      </register-group>
      <register-group name="HMATRIXB" caption="HSB Matrix">
        <register-group name="PRS" name-in-module="PRS" offset="0x080" size="0x8" count="16"/>
        <register name="SFR" offset="0x110" rw="RW" size="4" access-size="4" count="16" initval="0x00000000" caption="Special Function">
          <bitfield name="SFR" caption="Special Function Register" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
    </module>
